import React, { Fragment } from "react"
import { UserName } from "./userName"

export const AnswerBody = () => {
    return (
        <Fragment>
            <style jsx>
                {`
                    .question__answer--body {
                        width: 80%;
                        margin: 0 auto;
                        border-bottom: 1px solid #4e524e;
                        padding: 50px;
                    }

                    .question__answer--user {
                        height: 30px;
                        font-size: 14px;
                        display: flex;
                        justify-content: flex-end;
                        padding: 30px;
                        line-height: 30px;
                    }

                    .question__answer--text {
                        padding: 30px;
                    }
                `}
            </style>
            <div className="question__answer--body">
                <div className="question__answer--text">
                    <span>
                        回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答
                        回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答
                        回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答
                        回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答
                        回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答
                        回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答
                        回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答
                        回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答
                        回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答
                        回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答
                        回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答
                        回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答
                        回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答
                        回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答
                        回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答
                        回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答
                        回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答
                        回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答
                        回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答
                        回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答回答
                    </span>
                </div>
                <div className="question__answer--user">
                    <span>投稿 2021/12/18</span>
                    <UserName size="30" />
                </div>
            </div>
        </Fragment>
    )
}
